ИнКар.Маркетплейсы/src/InformationRegisters/МП_СостояниеПрофилей/МП_СостояниеПрофилей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МП_СостояниеПрофилей</name>
  <resources>
    <name>ПоследнееОбновление</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Профиль</name>
    <type>
      <types>CatalogRef.МП_Профили</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИнКар.Маркетплейсы/src/InformationRegisters/МП_КатегорииYML/МП_КатегорииYML.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МП_КатегорииYML</name>
  <resources>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>parentId</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АвитоПодкатегорияТоваров</name>
    <type>
      <types>CatalogRef.МП_АвитоПодкатегорииТоваров</types>
    </type>
  </resources>
  <dimensions>
    <name>id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Категория</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИнКар.Маркетплейсы/src/Enums/МП_ВидыМаркетплейсов/МП_ВидыМаркетплейсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МП_ВидыМаркетплейсов</name>
  <enumValues>
    <name>VK</name>
  </enumValues>
  <enumValues>
    <name>ДРОМ</name>
  </enumValues>
  <enumValues>
    <name>Avito</name>
  </enumValues>
  <enumValues>
    <name>СберМегаМаркет</name>
  </enumValues>
  <enumValues>
    <name>Юла</name>
  </enumValues>
  <enumValues>
    <name>ДубльГис</name>
  </enumValues>
</mdclass:Enum>

ИнКар.Маркетплейсы/src/Enums/МП_ВариантыПубликацииКартинок/МП_ВариантыПубликацииКартинок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МП_ВариантыПубликацииКартинок</name>
  <enumValues>
    <name>НеПубликовать</name>
  </enumValues>
  <enumValues>
    <name>ТолькоОсновную</name>
  </enumValues>
  <enumValues>
    <name>ПубликоватьВсе</name>
  </enumValues>
</mdclass:Enum>

ИнКар.Маркетплейсы/src/Enums/МП_ВариантыФормированияНаличия/МП_ВариантыФормированияНаличия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МП_ВариантыФормированияНаличия</name>
  <enumValues>
    <name>ВсегдаВНаличии</name>
  </enumValues>
  <enumValues>
    <name>ВсегдаПодЗаказ</name>
  </enumValues>
  <enumValues>
    <name>ПоГруппеСкладов</name>
  </enumValues>
  <enumValues>
    <name>ПоОсновномуСкладу</name>
  </enumValues>
</mdclass:Enum>

ИнКар.Маркетплейсы/src/Enums/МП_АвитоДоступность/МП_АвитоДоступность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МП_АвитоДоступность</name>
  <enumValues>
    <name>ВНаличии</name>
  </enumValues>
  <enumValues>
    <name>ПодЗаказ</name>
  </enumValues>
</mdclass:Enum>

ИнКар.Маркетплейсы/src/Catalogs/МП_Профили/МП_Профили.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МП_Профили</name>
  <attributes>
    <name>ВидМаркетплейса</name>
    <type>
      <types>EnumRef.МП_ВидыМаркетплейсов</types>
    </type>
  </attributes>
  <attributes>
    <name>Client_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Client_secret</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделительРазделов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Шапка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подвал</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПубликоватьКартинки</name>
    <type>
      <types>EnumRef.МП_ВариантыПубликацииКартинок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПубликоватьМоделиАвтомобилей</name>
    <type>
      <types>EnumRef.МП_ВариантыПубликацииМоделейАвтомобилей</types>
    </type>
  </attributes>
  <attributes>
    <name>МоделиШапка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МоделиПодвал</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВедущийМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантФормированияНаличия</name>
    <type>
      <types>EnumRef.МП_ВариантыФормированияНаличия</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОсновной</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>НаличиеШапка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаличиеПодвал</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СообщениеОНедоступности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПредставленияСкладов</name>
    <type>
      <types>EnumRef.МП_ВариантыПредставленияСкладов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПубликоватьПроизводителя</name>
    <type>
      <types>EnumRef.МП_ВариантыИспользованияПроизводителя</types>
    </type>
  </attributes>
  <attributes>
    <name>ПубликоватьОписаниеВида</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПубликоватьОписаниеНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозможностьНаписатьСообщениеПоОбъявлениюЧерезСайт</name>
    <comment>&lt;AllowEmail>Нет&lt;/AllowEmail></comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>URLЗагрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитВидео</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗоныПоказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Shop_name</name>
    <comment>Короткое название магазина. В названии нельзя использовать слова, которые не относятся к наименованию магазина (например «лучший», «дешевый»), указывать номер телефона и т. п.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Shop_company</name>
    <comment>Полное наименование компании, владеющей магазином. Не публикуется.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Shop_url</name>
    <comment>URL главной страницы магазина. Максимальная длина ссылки — 2048 символов. Допускаются кириллические ссылки. URL‑адрес формируется на основе стандарта RFC 3986</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Shop_email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияОбъявления</name>
    <comment>&lt;Category>Запчасти и аксессуары&lt;/Category></comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗоныПоказа</name>
    <attributes>
      <name>ЗонаПоказа</name>
      <type>
        <types>CatalogRef.МП_АвитоЗоныПоказа</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СегментыНоменклатуры</name>
    <attributes>
      <name>Сегмент</name>
      <type>
        <types>CatalogRef.СегментыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоОсновнойСегмент</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПлатногоРазмещения</name>
      <comment>&lt;ListingFee>PackageSingle&lt;/ListingFee></comment>
      <type>
        <types>EnumRef.МП_АвитоВариантыПлатногоРазмещения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлатнаяУслуга</name>
      <comment>&lt;AdStatus>x10_7&lt;/AdStatus></comment>
      <type>
        <types>CatalogRef.МП_АвитоПлатныеУслуги</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидОбъявления</name>
      <comment>&lt;AdType>Товар от производителя&lt;/AdType></comment>
      <type>
        <types>EnumRef.МП_АвитоВидыОбъявлений</types>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <comment>&lt;Condition>Новое&lt;/Condition></comment>
      <type>
        <types>EnumRef.МП_АвитоСостояние</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИнКар.Маркетплейсы/src/CommonModules/МП_ДромВызовСервера/Module.bsl
//
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Область Информация
//
//		https://baza.drom.ru/help/XmlPriceCreate1
//======================================================================================================================		
//		Для раздела "Автозапчасти":  
//			- Укажите применимость ав​тозапчасти: это повысит пользовательский интерес к Вашему товару;
//			- Размещайте информацию о каждом параметре в отдельные теги: марка, модель, кузов, двигатель, ОЕМ-номер,
//			  номера-аналоги, год, цвет, производитель.
//----------------------------------------------------------------------------------------------------------------------			   
//<?xml version="1.0" encoding="UTF-8"?>
//
//<offers>
//    <offer>
//        <name>Амортизатор</name>
//        <oem_number>334388</oem_number>
//        <analog_numbers>4853033281,4853033291,4853039885,DS2130GS </analog_numbers>
//        <manufacturer>KYB</manufacturer>
//        <ordercode>577</ordercode>
//        <condition>Б/у</condition>
//        <brandcars>Honda</brandcars>
//        <modelcars>Airwave</modelcars>
//        <bodycars>GJ1</bodycars>
//        <engine>1MZFE</engine>
//        <year>2002</year>
//        <lr>лево</lr>
//        <fr>перед</fr>
//        <ud>низ</ud>
//        <color></color>
//    </offer>
//</offers>
//======================================================================================================================
//		Для других разделов:
//----------------------------------------------------------------------------------------------------------------------
//<?xml version="1.0" encoding="UTF-8"?>
//<!DOCTYPE yml_catalog SYSTEM "shops.dtd">
//
//<yml_catalog date="2010-04-01 17:00">
//    <shop>
//        <offers>
//            <offer id="12341">
//                <name>Каталка</name>
//                <description>Качалка Smoby 412008; Тип: Каталка </description>
//                <price>8240</price>
//                <currencyId>RUR</currencyId>
//                <picture>http://ismoby.ru/products_pictures/412006_Z_vue02_enl.jpg</picture>
//            </offer>
//        </offers>
//    </shop>
//</yml_catalog>
//
//======================================================================================================================
//	https://baza.drom.ru/help/API - Обновление прайс-листов по API (не реализовано) 
//	
#КонецОбласти

#Область ПрограммныйИнтерфейс

#Область ПакетныеМетоды
// Методы, предназначенные для пакетной обработки обмена с сайтом Авито.
// Пригодны для запуска в качестве регламентного задания

Процедура СформироватьФайлыАвтозагрузок() Экспорт

	НаборПрофилей = Справочники.МП_Профили.ГотовыКАвтозагрузке();

	ДополнительныеПараметры = Новый Структура;

	Для Каждого Профиль Из НаборПрофилей Цикл
		СформироватьПрайс(Профиль, ДополнительныеПараметры);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область МетодыПрофилей

Функция СформироватьПрайс(Профиль, ДополнительныеПараметры) Экспорт

	СписокПредложений = Неопределено;
	КорневойУзел = Неопределено;
	ОписаниеМагазина = Неопределено;

	Счетчик = 0;

	Результат = Новый Структура("Сообщение, Ошибки");

	Если ЗначениеЗаполнено(Профиль) Тогда

		ПараметрыПрофиля = РеквизитыПрофиля(Профиль);
		ВидМаркетплейса = ПараметрыПрофиля.ВидМаркетплейса;
		ВидМаркетплейса = Новый Структура;
		
		// Флажки 
		ВидМаркетплейса.Вставить("ЭтоДРОМ", ПараметрыПрофиля.ВидМаркетплейса = Перечисления.МП_ВидыМаркетплейсов.ДРОМ);
		ВидМаркетплейса.Вставить("ЭтоВК", ПараметрыПрофиля.ВидМаркетплейса = Перечисления.МП_ВидыМаркетплейсов.VK);
		ВидМаркетплейса.Вставить("ЭтоAVITO", ПараметрыПрофиля.ВидМаркетплейса = Перечисления.МП_ВидыМаркетплейсов.Avito);
		ВидМаркетплейса.Вставить("ЭтоЮла", ПараметрыПрофиля.ВидМаркетплейса = Перечисления.МП_ВидыМаркетплейсов.Юла);
		ВидМаркетплейса.Вставить("Это2ГИС",
								 ПараметрыПрофиля.ВидМаркетплейса = Перечисления.МП_ВидыМаркетплейсов.ДубльГис);

		ПубликоватьВсеКартинки = (ПараметрыПрофиля.ПубликоватьКартинки
								  = Перечисления.МП_ВариантыПубликацииКартинок.ПубликоватьВсе);
		ПубликоватьПрименимость = (Метаданные.НайтиПоПолномуИмени("Подсистема.АвтосервисАвтомагазин") <> Неопределено);
		ПубликоватьВидео = ЗначениеЗаполнено(ПараметрыПрофиля.РеквизитВидео);
		ПубликоватьВсеОстатки = (ПараметрыПрофиля.ВариантФормированияНаличия
								 = Перечисления.МП_ВариантыФормированияНаличия.ПоГруппеСкладов);

		// Имена узлов в зависимости от вида маркетплейса
		ИмяЭлементаТекстОбъявления = ?(ВидМаркетплейса.ЭтоAVITO, "Description", "description");
		ИмяЭлементаОбъявление = ?(ВидМаркетплейса.ЭтоAVITO, "Ad", "offer");
		
		// Получение коллекций товаров и дополнительных данных для объявлений
		ДляОбъявлений = Справочники.МП_Профили.ТоварыПрофиля(Профиль);

		НаВыгрузку = ДляОбъявлений.Товары;
		ДопРеквизиты = ДляОбъявлений.Свойства;
		НаборИзображений = ДляОбъявлений.Картинки;
		НаборМоделей = ДляОбъявлений.Модели;
		Остатки = ДляОбъявлений.Остатки;

		// Подготовка счетчиков для отображения прогресса выполнения
		ВсегоОбъявлений = НаВыгрузку.Количество();
		Приращение = Окр(ВсегоОбъявлений / 100, 0);
		Приращение = ?(Приращение = 0, 1, Приращение);

		// Формирование документа DOM
		Если НаВыгрузку.Количество() > 0 Тогда

			// Получение коллекции зон показа
			ПубликоватьЗоныПоказа = ПараметрыПрофиля.ИспользоватьЗоныПоказа;

			Если ПубликоватьЗоныПоказа Тогда
				НаборЗон = Справочники.МП_Профили.ЗоныПоказа(Профиль);
			КонецЕсли;

			// Создание и инициализация документа DOM			
			ДокDOM = ИнициализироватьДокументDOM(ПараметрыПрофиля, СписокПредложений, ОписаниеМагазина, КорневойУзел);

			// Цикл формирования объявлений
			Пока НаВыгрузку.Следующий() Цикл

				ОтборПоТовару = Новый Структура("Номенклатура, Характеристика",
												НаВыгрузку.Номенклатура,
												НаВыгрузку.Характеристика);
				// Создание объявления
				ОбъявлениеDOM = ДокDOM.СоздатьЭлемент(ИмяЭлементаОбъявление);

				// Заполнение узлов в зависимости от вида маркетплейса
				Если ВидМаркетплейса.ЭтоВК Или ВидМаркетплейса.Это2ГИС Тогда
					СоздатьУзлыВК(НаВыгрузку, ОбъявлениеDOM, ДокDOM);
				ИначеЕсли ВидМаркетплейса.ЭтоДРОМ Тогда
					СоздатьУзлыДРОМ(НаВыгрузку, ОбъявлениеDOM, ДокDOM);
				ИначеЕсли ВидМаркетплейса.ЭтоAVITO Тогда
					СоздатьУзлыAVITO(НаВыгрузку, ПараметрыПрофиля, ОбъявлениеDOM, ДокDOM);
				ИначеЕсли ВидМаркетплейса.ЭтоЮла Тогда
					СоздатьУзлыЮла(НаВыгрузку, ПараметрыПрофиля, ОбъявлениеDOM, ДокDOM);
				ИначеЕсли ВидМаркетплейса.Это2ГИС Тогда
					СоздатьУзлы2ГИС(НаВыгрузку, ПараметрыПрофиля, ОбъявлениеDOM, ДокDOM);
				КонецЕсли;				
				
				// Формирование текста объявления
				ТО = Новый Массив;

				ВставитьШапку(ТО, ПараметрыПрофиля, ВидМаркетплейса);
				ВставитьНаименованиеНоменклатуры(ТО, НаВыгрузку, ВидМаркетплейса);
				ВставитьОписаниеНоменклатуры(ТО, НаВыгрузку);

				Если ПубликоватьПрименимость Тогда
					ВставитьПрименимость(ТО, ПараметрыПрофиля, ОтборПоТовару, НаборМоделей, ВидМаркетплейса);
				КонецЕсли;

				Если ПубликоватьВсеОстатки И ВидМаркетплейса.ЭтоAVITO Тогда
					Доступность = ВставитьОстатки(ТО, ПараметрыПрофиля, ОтборПоТовару, Остатки, ВидМаркетплейса);
					СоздатьДочернийЭлемент("Availability", ОбъявлениеDOM, Строка(Доступность), ДокDOM);
				КонецЕсли;

				ВставитьХарактеристики(ТО, ПараметрыПрофиля, ОтборПоТовару, ДопРеквизиты, ВидМаркетплейса);
				ВставитьПодвал(ТО, ПараметрыПрофиля, ВидМаркетплейса);
				
				// Узел <Description>
				ТекстОбъявления = СтрСоединить(ТО);

				Если СтрДлина(ТекстОбъявления) > 0 Тогда
					Элемент = ДокDOM.СоздатьЭлемент(ИмяЭлементаТекстОбъявления);
					Если ВидМаркетплейса.ЭтоAVITO Тогда
						Секция = ДокDOM.СоздатьСекциюCDATA(ТекстОбъявления);
						Элемент.ДобавитьДочерний(Секция);
					Иначе
						Элемент.ТекстовоеСодержимое = ТекстОбъявления;
					КонецЕсли;
					ОбъявлениеDOM.ДобавитьДочерний(Элемент);
				КонецЕсли;
						
				// Секция картинок
				Если ПубликоватьВсеКартинки Тогда
					СоздатьУзлыКартинок(ДокDOM,
										ОбъявлениеDOM,
										ВидМаркетплейса,
										ОтборПоТовару,
										НаборИзображений,
										ПараметрыПрофиля.URLЗагрузки);
				КонецЕсли;
	
				// Добавление видео
				Если ПубликоватьВидео Тогда
					ВставитьУзелВидео(ДокDOM, ОбъявлениеDOM, НаВыгрузку, ПараметрыПрофиля);
				КонецЕсли;
	
				// Добавление зон показа
				Если ПубликоватьЗоныПоказа Тогда
					СоздатьУзелЗоныПоказа(ДокDOM, ОбъявлениеDOM, НаборЗон);
				КонецЕсли;
	
				// Секция применимость
				Если ПубликоватьПрименимость И ВидМаркетплейса.ЭтоДРОМ Тогда

					КоллекцияМоделей = КоллекцияМоделейDOM(НаВыгрузку.Номенклатура, НаВыгрузку.Характеристика, ДокDOM);

					Если КоллекцияМоделей.ЕстьДочерниеУзлы() Тогда
						ОбъявлениеDOM.ДобавитьДочерний(КоллекцияМоделей);
					КонецЕсли;

				КонецЕсли;

				// Добавление объявления в документ
				ВставитьОбъявлениеВДокумент(ВидМаркетплейса, СписокПредложений, ДокDOM, ОбъявлениеDOM);

				Счетчик = Счетчик + 1;

				Если Счетчик % Приращение = 0 Тогда
					ТекстСообщения = СтрШаблон("Обработано %1 из %2 объявлений", Счетчик, ВсегоОбъявлений);
					ДлительныеОперации.СообщитьПрогресс(Формат(Счетчик / ВсегоОбъявлений * 100, "ЧДЦ=2;"),
														ТекстСообщения);
				КонецЕсли;

			КонецЦикла;

			Если ВидМаркетплейса.ЭтоВК Или ВидМаркетплейса.Это2ГИС Тогда
				
				// Добавление списка предложений в описание магазина
				ОписаниеМагазина.ДобавитьДочерний(СписокПредложений);
				
				// Добавление магазина в DOM
				КорневойУзел.ДобавитьДочерний(ОписаниеМагазина);

			КонецЕсли;
			
			// Сохранение ДокументDOM в файл
			Если ДокDOM.ЕстьДочерниеУзлы() Тогда
				МП_УниверсальныеМетодыВызовСервера.СохранитьДокументDOMВФайле(ДокDOM,
																			  ПараметрыПрофиля.ИмяФайлаВыгрузки,
																			  ПространствоИменДром());
				ЗафиксироватьВРегистре(Профиль, Счетчик);

			КонецЕсли;

		КонецЕсли;

	Иначе
		Результат.Вставить("Ошибки", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Не задан профиль"));
	КонецЕсли;

	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область УзлыФайловОбъявлений

Процедура СоздатьУзлыВК(НаВыгрузку, ОбъявлениеDOM, ДокDOM)

	ОбъявлениеDOM.УстановитьАтрибут("id", НаВыгрузку.Код);
	СоздатьДочернийЭлемент("name", ОбъявлениеDOM, НаВыгрузку.НоменклатураНаименование, ДокDOM);
	СоздатьДочернийЭлементСПроверкой("vendor", ОбъявлениеDOM, НаВыгрузку.Производитель, ДокDOM);
	СоздатьДочернийЭлемент("vendorCode", ОбъявлениеDOM, НаВыгрузку.Артикул, ДокDOM);
	СоздатьДочернийЭлемент("price", ОбъявлениеDOM, НаВыгрузку.ЦенаСоСкидкой, ДокDOM, Истина);
	СоздатьДочернийЭлемент("store", ОбъявлениеDOM, "true", ДокDOM);

КонецПроцедуры

Процедура СоздатьУзлыЮла(НаВыгрузку, ПараметрыПрофиля, ОбъявлениеDOM, ДокDOM)

	Перем Название;

	ОбъявлениеDOM.УстановитьАтрибут("id", НаВыгрузку.Код);

	СоздатьКраткоеНазваниеОбъявления(НаВыгрузку, Название);

	СоздатьДочернийЭлемент("name", ОбъявлениеDOM, Название.НазваниеОбъявления, ДокDOM);

	СоздатьДочернийЭлементСПроверкой("youlaCategoryId", ОбъявлениеDOM, НаВыгрузку.ЮлаКатегория, ДокDOM);
	СоздатьДочернийЭлементСПроверкой("youlaSubcategoryId", ОбъявлениеDOM, НаВыгрузку.ЮлаПодкатегория, ДокDOM);

	Если Не ПустаяСтрока(НаВыгрузку.ЮлаТегПодкатегории) И Не ПустаяСтрока(НаВыгрузку.ЮлаТипДетали) Тогда
		СоздатьДочернийЭлемент(НаВыгрузку.ЮлаТегПодкатегории, ОбъявлениеDOM, НаВыгрузку.ЮлаТипДетали, ДокDOM);
	КонецЕсли;

	СоздатьДочернийЭлементСПроверкой("kuzovnaya_detal", ОбъявлениеDOM, НаВыгрузку.ЮлаГруппаДеталей, ДокDOM);
	СоздатьДочернийЭлементСПроверкой("chast_detali", ОбъявлениеDOM, НаВыгрузку.ЮлаНазваниеДетали, ДокDOM);

	СоздатьДочернийЭлемент("price", ОбъявлениеDOM, НаВыгрузку.ЦенаСоСкидкой, ДокDOM, Истина);
	СоздатьДочернийЭлемент("phone", ОбъявлениеDOM, ПараметрыПрофиля.ТелефонПоУмолчанию, ДокDOM);
	СоздатьДочернийЭлемент("address", ОбъявлениеDOM, ПараметрыПрофиля.АдресПоУмолчанию, ДокDOM);
	СоздатьДочернийЭлемент("managerName", ОбъявлениеDOM, ПараметрыПрофиля.МенеджерИмя, ДокDOM);

КонецПроцедуры

Процедура СоздатьУзлыДРОМ(НаВыгрузку, ОбъявлениеDOM, ДокDOM)

	СоздатьДочернийЭлемент("name", ОбъявлениеDOM, НаВыгрузку.НоменклатураНаименованиеПолное, ДокDOM);
	СоздатьДочернийЭлементСПроверкой("manufacturer", ОбъявлениеDOM, НаВыгрузку.Производитель, ДокDOM);
	СоздатьДочернийЭлемент("ordercode", ОбъявлениеDOM, НаВыгрузку.Артикул, ДокDOM);
	СоздатьДочернийЭлемент("condition", ОбъявлениеDOM, НаВыгрузку.condition, ДокDOM);
	СоздатьДочернийЭлемент("price", ОбъявлениеDOM, НаВыгрузку.ЦенаСоСкидкой, ДокDOM, Истина);
	СоздатьДочернийЭлемент("currencyId", ОбъявлениеDOM, НаВыгрузку.currencyId, ДокDOM);
	СоздатьДочернийЭлемент("status", ОбъявлениеDOM, НаВыгрузку.status, ДокDOM);

КонецПроцедуры

Процедура СоздатьУзлыAVITO(НаВыгрузку, ПараметрыПрофиля, ОбъявлениеDOM, ДокDOM)

	Перем Название;
	Перем ID;

	ID = СтрШаблон("%1$%2$БезХарактеристики", ПараметрыПрофиля.Код, НаВыгрузку.Код);

	СоздатьКраткоеНазваниеОбъявления(НаВыгрузку, Название);

	СоздатьДочернийЭлемент("Title", ОбъявлениеDOM, Название.НазваниеОбъявления, ДокDOM);
	СоздатьДочернийЭлементСПроверкой("ListingFee", ОбъявлениеDOM, НаВыгрузку.ВариантПлатногоРазмещения, ДокDOM);
	СоздатьДочернийЭлементСПроверкой("AdStatus", ОбъявлениеDOM, НаВыгрузку.ПлатнаяУслуга, ДокDOM);
	СоздатьДочернийЭлемент("ContactPhone", ОбъявлениеDOM, ПараметрыПрофиля.ТелефонПоУмолчанию, ДокDOM);
	СоздатьДочернийЭлемент("Address", ОбъявлениеDOM, ПараметрыПрофиля.АдресПоУмолчанию, ДокDOM);
	СоздатьДочернийЭлемент("Category", ОбъявлениеDOM, "Запчасти и аксессуары", ДокDOM);
	СоздатьДочернийЭлемент("TypeId", ОбъявлениеDOM, НаВыгрузку.TypeidAvito, ДокDOM);
		// TODO: Сделать возможность публиковать объявления на своё производство
	СоздатьДочернийЭлемент("AdType", ОбъявлениеDOM, "Товар приобретен на продажу", ДокDOM);
		// TODO: Сделать возможность публиковать объявления на б/у
	СоздатьДочернийЭлемент("Condition", ОбъявлениеDOM, "Новое", ДокDOM);
	СоздатьДочернийЭлемент("ID", ОбъявлениеDOM, ID, ДокDOM);
	СоздатьДочернийЭлементСПроверкой("Brand", ОбъявлениеDOM, НаВыгрузку.Производитель, ДокDOM);
	СоздатьДочернийЭлемент("AllowEmail", ОбъявлениеDOM, "Да", ДокDOM);
	СоздатьДочернийЭлемент("Price", ОбъявлениеDOM, НаВыгрузку.ЦенаСоСкидкой, ДокDOM, Истина);
	СоздатьДочернийЭлемент("ManagerName", ОбъявлениеDOM, ПараметрыПрофиля.МенеджерИмя, ДокDOM);
//	<DateEnd>2079-08-28</DateEnd>
	СоздатьДочернийЭлемент("DateEnd", ОбъявлениеDOM, "2023-01-01", ДокDOM);

КонецПроцедуры

Процедура СоздатьУзлы2ГИС(НаВыгрузку, ПараметрыПрофиля, ОбъявлениеDOM, ДокDOM)

	ОбъявлениеDOM.УстановитьАтрибут("id", НаВыгрузку.Код);
	СоздатьДочернийЭлемент("name", ОбъявлениеDOM, НаВыгрузку.НоменклатураНаименование, ДокDOM);
	СоздатьДочернийЭлементСПроверкой("vendor", ОбъявлениеDOM, НаВыгрузку.Производитель, ДокDOM);
	СоздатьДочернийЭлемент("vendorCode", ОбъявлениеDOM, НаВыгрузку.Артикул, ДокDOM);
	СоздатьДочернийЭлемент("price", ОбъявлениеDOM, НаВыгрузку.ЦенаСоСкидкой, ДокDOM, Истина);
	СоздатьДочернийЭлемент("store", ОбъявлениеDOM, "true", ДокDOM);

КонецПроцедуры

Процедура СоздатьУзлыКартинок(ДокDOM, ОбъявлениеDOM, ВидМаркетплейса, ОтборПоТовару, НаборИзображений, URLЗагрузки)

	Перем КоллекцияИзображений;
	Перем Изображение;
	Перем URLИзображения;
	
	// Имена узлов в зависимости от вида маркетплейса
	ИмяКоллекцииИзображений = ?(ВидМаркетплейса.ЭтоAVITO, "Images", "pictures");
	ИмяЭлементаИзображений = ?(ВидМаркетплейса.ЭтоAVITO, "Image", "picture");

	Если ВидМаркетплейса.ЭтоВК Или ВидМаркетплейса.ЭтоЮла  Или ВидМаркетплейса.Это2ГИС Тогда

		Пока НаборИзображений.НайтиСледующий(ОтборПоТовару) Цикл

			URLИзображения = URLЗагрузки + НаборИзображений.ПутьКФайлу;
			СоздатьДочернийЭлемент(ИмяЭлементаИзображений, ОбъявлениеDOM, URLИзображения, ДокDOM);

		КонецЦикла;

	ИначеЕсли ВидМаркетплейса.ЭтоAVITO Тогда

		КоллекцияИзображений = ДокDOM.СоздатьЭлемент(ИмяКоллекцииИзображений);

		Пока НаборИзображений.НайтиСледующий(ОтборПоТовару) Цикл

			URLИзображения = URLЗагрузки + НаборИзображений.ПутьКФайлу;
			Изображение = ДокDOM.СоздатьЭлемент(ИмяЭлементаИзображений);
			Изображение.УстановитьАтрибут("url", URLИзображения);
			КоллекцияИзображений.ДобавитьДочерний(Изображение);

		КонецЦикла;

		Если КоллекцияИзображений.ЕстьДочерниеУзлы() Тогда
			ОбъявлениеDOM.ДобавитьДочерний(КоллекцияИзображений);
		КонецЕсли;

	ИначеЕсли ВидМаркетплейса.ЭтоДРОМ Тогда

		КоллекцияИзображений = ДокDOM.СоздатьЭлемент(ИмяКоллекцииИзображений);

		Пока НаборИзображений.НайтиСледующий(ОтборПоТовару) Цикл

			URLИзображения = URLЗагрузки + НаборИзображений.ПутьКФайлу;
			Изображение = ДокDOM.СоздатьЭлемент(ИмяЭлементаИзображений);
			Изображение.ТекстовоеСодержимое = URLИзображения;
			КоллекцияИзображений.ДобавитьДочерний(Изображение);

		КонецЦикла;

		Если КоллекцияИзображений.ЕстьДочерниеУзлы() Тогда
			ОбъявлениеDOM.ДобавитьДочерний(КоллекцияИзображений);
		КонецЕсли;

	КонецЕсли;

	НаборИзображений.Сбросить();

КонецПроцедуры

Процедура СоздатьУзелЗоныПоказа(ДокDOM, ОбъявлениеDOM, НаборЗон)

	Перем ЗоныПоказаСписок;
	Перем Зона;

	ЗоныПоказаСписок = ДокDOM.СоздатьЭлемент("DisplayAreas");

	Для Каждого Зона Из НаборЗон Цикл
		СоздатьДочернийЭлемент("Area", ЗоныПоказаСписок, Зона, ДокDOM);
	КонецЦикла;

	ОбъявлениеDOM.ДобавитьДочерний(ЗоныПоказаСписок);

КонецПроцедуры

Процедура ВставитьУзелВидео(ДокDOM, ОбъявлениеDOM, НаВыгрузку, ПараметрыПрофиля)

	Перем РеквизитПолноеНаименование;
	Перем НайденРеквизит;
	Перем VideoURL;

	РеквизитПолноеНаименование = "ПолноеНаименование";

	НайденРеквизит = УправлениеСвойствами.ЗначениеСвойства(НаВыгрузку.Номенклатура, ПараметрыПрофиля.РеквизитВидео);
	Если НайденРеквизит <> Неопределено Тогда

		VideoURL = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НайденРеквизит, РеквизитПолноеНаименование);
		СоздатьДочернийЭлемент("VideoURL", ОбъявлениеDOM, VideoURL, ДокDOM);

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ТекстОбъявления

Процедура ВставитьШапку(ТО, ПараметрыПрофиля, ВидМаркетплейса)

	Если СтрДлина(ПараметрыПрофиля.Шапка) > 0 Тогда

		ТО.Добавить(ПараметрыПрофиля.Шапка);

		Если Не ВидМаркетплейса.ЭтоAVITO Тогда
			ТО.Добавить(Символы.ПС);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

Процедура ВставитьНаименованиеНоменклатуры(ТО, НаВыгрузку, ВидМаркетплейса)

	Если ВидМаркетплейса.ЭтоAVITO Или ВидМаркетплейса.ЭтоЮла Тогда
		ТО.Добавить(НаВыгрузку.НоменклатураНаименованиеПолное);
		ТО.Добавить(Символы.ПС);
	КонецЕсли;

КонецПроцедуры

Процедура ВставитьОписаниеНоменклатуры(ТО, НаВыгрузку)

	Если СтрДлина(НаВыгрузку.НоменклатураОписание) > 4 Тогда
		ТО.Добавить(НаВыгрузку.НоменклатураОписание);
		ТО.Добавить(Символы.ПС);
	КонецЕсли;

КонецПроцедуры

Процедура ВставитьПрименимость(ТО, ПараметрыПрофиля, ОтборПоТовару, НаборМоделей, ВидМаркетплейса)

	Перем Модели;
	Перем СтрокаМодель;

	Если ВидМаркетплейса.ЭтоДРОМ Тогда
		Возврат;
	КонецЕсли;

	ТегиHTML = МП_КонстантыКлиентСерверПовтИсп.ТегиHTML();

	Модели = Новый Массив;
	Пока НаборМоделей.НайтиСледующий(ОтборПоТовару) Цикл
		Модели.Добавить(НаборМоделей.КлючМодели);
	КонецЦикла;

	НаборМоделей.Сбросить();

	Если Модели.Количество() > 0 Тогда

		Если ВидМаркетплейса.ЭтоВК Или ВидМаркетплейса.ЭтоЮла Или ВидМаркетплейса.Это2ГИС Тогда

			ТО.Добавить("Подходит для следующих моделей автомобилей:");
			ТО.Добавить(Символы.ПС);

			Для Каждого Элемент Из Модели Цикл
				СтрокаМодель = СтрШаблон("  - %1", Элемент);
				ТО.Добавить(СтрокаМодель);
				ТО.Добавить(Символы.ПС);
			КонецЦикла;

		ИначеЕсли ВидМаркетплейса.ЭтоAVITO Тогда

			ТО.Добавить(ПараметрыПрофиля.РазделительРазделов);
			ТО.Добавить("Подходит для следующих моделей автомобилей:");
			ТО.Добавить(Символы.ПС);

			ТО.Добавить(ТегиHTML.Юл);
			Для Каждого Элемент Из Модели Цикл
				СтрокаМодель = СтрШаблон("%1%2", ТегиHTML.Ли, Элемент);
				ТО.Добавить(СтрокаМодель);
			КонецЦикла;
			ТО.Добавить(ТегиHTML.ЮлК);

		КонецЕсли;

	КонецЕсли;

	НаборМоделей.Сбросить();

КонецПроцедуры

Функция ВставитьОстатки(ТО, ПараметрыПрофиля, ОтборПоТовару, Остатки, ВидМаркетплейса)

	ТегиHTML = МП_КонстантыКлиентСерверПовтИсп.ТегиHTML();

	СкладыСОстатками = Новый СписокЗначений;

	Пока Остатки.НайтиСледующий(ОтборПоТовару) Цикл
		Если СтрНайти(Остатки.СкладAvito, "()") = 0 Тогда
			СкладЗначение = СтрЗаменить(Остатки.СкладAvito, " г)", ")");
			СкладыСОстатками.Добавить(СкладЗначение, Остатки.Свободно);
		КонецЕсли;
	КонецЦикла;

	Остатки.Сбросить();

	ТО.Добавить(ПараметрыПрофиля.РазделительРазделов);

	Если СкладыСОстатками.Количество() > 0 Тогда

		ТО.Добавить(ПараметрыПрофиля.НаличиеШапка);
		ТО.Добавить(ТегиHTML.Юл);

		Для Каждого Элемент Из СкладыСОстатками Цикл
			ТО.Добавить(Элемент.Значение);
		КонецЦикла;

		ТО.Добавить(ТегиHTML.ЮлК);
		ТО.Добавить(ПараметрыПрофиля.НаличиеПодвал);

		Доступность = Перечисления.МП_АвитоДоступность.ВНаличии;

	Иначе

		ТО.Добавить(ПараметрыПрофиля.СообщениеОНедоступности);
		ТО.Добавить(Символы.ПС);

		Доступность = Перечисления.МП_АвитоДоступность.ПодЗаказ;

	КонецЕсли;

	Возврат Доступность;

КонецФункции

Процедура ВставитьХарактеристики(ТО, ПараметрыПрофиля, ОтборПоТовару, ДопРеквизиты, ВидМаркетплейса)

	ЕстьХарактеристики = Ложь;

	Если ВидМаркетплейса.ЭтоAVITO Тогда

		ТегиHTML = МП_КонстантыКлиентСерверПовтИсп.ТегиHTML();

		Пока ДопРеквизиты.НайтиСледующий(ОтборПоТовару) Цикл
		
			// При необходимости добавляем заголовок списка
			Если Не ЕстьХарактеристики Тогда

				ТО.Добавить(ПараметрыПрофиля.РазделительРазделов);
				ТО.Добавить("Характеристики товара:");
				ТО.Добавить(ТегиHTML.Юл);

				ЕстьХарактеристики = Истина;

			КонецЕсли;

			ТО.Добавить(ТегиHTML.Ли);
			ТО.Добавить(ДопРеквизиты.Заголовок);
			ТО.Добавить(" -- ");
			ТО.Добавить(Строка(ДопРеквизиты.Значение));

		КонецЦикла;

		Если ЕстьХарактеристики Тогда
			ТО.Добавить(ТегиHTML.ЮлК);
		КонецЕсли;

	Иначе

		Пока ДопРеквизиты.НайтиСледующий(ОтборПоТовару) Цикл
		
			// При необходимости добавляем заголовок списка
			Если Не ЕстьХарактеристики Тогда

				ТО.Добавить(Символы.ПС);
				ТО.Добавить("Характеристики товара:");
				ТО.Добавить(Символы.ПС);

				ЕстьХарактеристики = Истина;

			КонецЕсли;

			ТО.Добавить(Символы.ПС);
			ТО.Добавить(ДопРеквизиты.Заголовок);
			ТО.Добавить(" -- ");
			ТО.Добавить(Строка(ДопРеквизиты.Значение));

		КонецЦикла;

		Если ЕстьХарактеристики Тогда
			ТО.Добавить(Символы.ПС);
		КонецЕсли;

	КонецЕсли;

	ДопРеквизиты.Сбросить();

КонецПроцедуры

Процедура ВставитьПодвал(ТО, ПараметрыПрофиля, ВидМаркетплейса)
	Если СтрДлина(ПараметрыПрофиля.Подвал) > 0 Тогда

		Если ВидМаркетплейса.ЭтоAVITO Тогда
			ТО.Добавить(ПараметрыПрофиля.РазделительРазделов);
		КонецЕсли;

		ТО.Добавить(ПараметрыПрофиля.Подвал);
		ТО.Добавить(Символы.ПС);

	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область МетодыXML

Процедура СоздатьДочернийЭлемент(Имя, Родитель, Значение, ДокументDOM, ЦелоеЧисло = Ложь)

	ЗначениеСтрока = ?(ЦелоеЧисло, Формат(Значение, "ЧДЦ=0; ЧГ=0;"), ?(ТипЗнч(Значение) = Тип("Строка"),
																	   Значение,
																	   Строка(Значение)));

	Элемент = ДокументDOM.СоздатьЭлемент(Имя);
	Элемент.ТекстовоеСодержимое = ЗначениеСтрока;
	Родитель.ДобавитьДочерний(Элемент);

КонецПроцедуры

Процедура СоздатьДочернийЭлементСПроверкой(Имя, Родитель, Значение, ДокументDOM, ЦелоеЧисло = Ложь)

	Если ЗначениеЗаполнено(Значение) Тогда
		СоздатьДочернийЭлемент(Имя, Родитель, Значение, ДокументDOM, ЦелоеЧисло);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область МетодыОбработки

Процедура СоздатьКраткоеНазваниеОбъявления(НаВыгрузку, Название)
	Название = Новый Структура("Номенклатура, Характеристика, НазваниеОбъявления",
							   НаВыгрузку.Номенклатура,
							   НаВыгрузку.Характеристика);
	МП_АвитоВызовСервера.ЗаполнитьНазваниеОбъявления(Название);
КонецПроцедуры

Процедура ВставитьОбъявлениеВДокумент(ВидМаркетплейса, СписокПредложений, ДокDOM, ОбъявлениеDOM)
	Если ВидМаркетплейса.ЭтоДРОМ Тогда
		ДокDOM.ЭлементДокумента.ДобавитьДочерний(ОбъявлениеDOM);
	ИначеЕсли ВидМаркетплейса.ЭтоВК Или ВидМаркетплейса.Это2ГИС Тогда
		СписокПредложений.ДобавитьДочерний(ОбъявлениеDOM);
	ИначеЕсли ВидМаркетплейса.ЭтоAVITO Тогда
		ДокDOM.ЭлементДокумента.ДобавитьДочерний(ОбъявлениеDOM);
	ИначеЕсли ВидМаркетплейса.ЭтоЮла Тогда
		СписокПредложений.ДобавитьДочерний(ОбъявлениеDOM);
	КонецЕсли;
КонецПроцедуры

Процедура ЗафиксироватьВРегистре(Знач Профиль, Знач Счетчик)

	Перем ВРегистр;

	ВРегистр = РегистрыСведений.МП_СостояниеПрофилей.СоздатьМенеджерЗаписи();
	ВРегистр.Профиль = Профиль;
	ВРегистр.Количество = Счетчик;
	ВРегистр.ПоследнееОбновление = ТекущаяДатаСеанса();

	ВРегистр.Записать(Истина);

КонецПроцедуры

// Возвращает реквизиты профиля
// 
// Параметры:
//  Профиль - СправочникСсылка.МП_Профили - Профиль
// 
// Возвращаемое значение:
//  Структура - Реквизиты профиля
Функция РеквизитыПрофиля(Профиль)

	Реквизиты = Новый Массив;

	Реквизиты.Добавить("ВидМаркетплейса");
	Реквизиты.Добавить("URLЗагрузки");
	Реквизиты.Добавить("ПубликоватьКартинки");
	Реквизиты.Добавить("ВариантФормированияНаличия");
	Реквизиты.Добавить("СкладОсновной");
	Реквизиты.Добавить("ИмяФайлаВыгрузки");
	Реквизиты.Добавить("Шапка");
	Реквизиты.Добавить("РазделительРазделов");
	Реквизиты.Добавить("Подвал");
	Реквизиты.Добавить("Shop_name");
	Реквизиты.Добавить("Shop_company");
	Реквизиты.Добавить("Shop_url");
	Реквизиты.Добавить("Shop_email");
	Реквизиты.Добавить("РеквизитВидео");
	Реквизиты.Добавить("ТелефонПоУмолчанию");
	Реквизиты.Добавить("АдресПоУмолчанию");
	Реквизиты.Добавить("ВедущийМенеджер");
	Реквизиты.Добавить("Код");
	Реквизиты.Добавить("ИспользоватьЗоныПоказа");
	Реквизиты.Добавить("СообщениеОНедоступности");
	Реквизиты.Добавить("НаличиеШапка");
	Реквизиты.Добавить("НаличиеПодвал");

	ПараметрыПрофиля = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Профиль, Реквизиты);

	МенеджерИмя = "Менеджер";

	Если ЗначениеЗаполнено(ПараметрыПрофиля.ВедущийМенеджер) Тогда

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Пользователь", ПараметрыПрофиля.ВедущийМенеджер);
		Запрос.Текст = "ВЫБРАТЬ
					   |	Пользователи.ФизическоеЛицо.Имя КАК ФизическоеЛицоИмя
					   |ИЗ
					   |	Справочник.Пользователи КАК Пользователи
					   |ГДЕ
					   |	Пользователи.Ссылка = &Пользователь";
		Выборка = Запрос.Выполнить().Выбрать();

		Если Выборка.Следующий() Тогда
			МенеджерИмя = Выборка.ФизическоеЛицоИмя;
		КонецЕсли;

	КонецЕсли;

	ПараметрыПрофиля.Вставить("МенеджерИмя", МенеджерИмя);

	Возврат ПараметрыПрофиля

КонецФункции

Функция ПространствоИменДром()
	Возврат "https://www.drom.ru/";
КонецФункции

Функция КоллекцияМоделейDOM(Номенклатура, Характеристика, ДокументDOM)

	КоллекцияМоделей = ДокументDOM.СоздатьЭлемент("cars");

	Модели = Новый Массив;
	Выполнить ("Справочники.КА2_КлючиМоделей.НайтиПоНоменклатуреДляДром(Номенклатура, Характеристика, Модели)");

	Если Модели.Количество() > 0 Тогда

		Для Каждого Эл Из Модели Цикл

			Модель = ДокументDOM.СоздатьЭлемент("car");

			Для Каждого Ключ Из Эл Цикл
				Если Не ПустаяСтрока(Ключ.Значение) Тогда
					МодельУзел = ДокументDOM.СоздатьЭлемент(Ключ.Ключ);
					МодельУзел.ТекстовоеСодержимое = Ключ.Значение;
					Модель.ДобавитьДочерний(МодельУзел);
				КонецЕсли;
			КонецЦикла;

			КоллекцияМоделей.ДобавитьДочерний(Модель);

		КонецЦикла;

	КонецЕсли;

	Возврат КоллекцияМоделей;

КонецФункции

Функция ИнициализироватьДокументDOM(ПараметрыПрофиля, СписокПредложений, ОписаниеМагазина, КорневойУзел)

	Перем СписокВалют;
	Перем ДатаВремя;
	Перем СписокКатегорий;
	Перем Валюта;

	ВидМаркетплейса = ПараметрыПрофиля.ВидМаркетплейса;

	// Получение имени корневого элемента
	ИмяКорневогоЭлемента = ?(ВидМаркетплейса = Перечисления.МП_ВидыМаркетплейсов.ДРОМ,
							 "offers",
							 ?(ВидМаркетплейса = Перечисления.МП_ВидыМаркетплейсов.Avito, "Ads", "yml_catalog"));
	
	// Создание документа DOM
	ДокDOM = Новый ДокументDOM(ПространствоИменДром(), ИмяКорневогоЭлемента);
	
	// Узлы вне коллекции объявлений и атрибуты документов
	Если ВидМаркетплейса = Перечисления.МП_ВидыМаркетплейсов.Avito Тогда

		ДокDOM.ЭлементДокумента.УстановитьАтрибут("formatVersion", "3");
		ДокDOM.ЭлементДокумента.УстановитьАтрибут("target", "Avito.ru");

	КонецЕсли;

	Если ВидМаркетплейса = Перечисления.МП_ВидыМаркетплейсов.VK
		 Или ВидМаркетплейса = Перечисления.МП_ВидыМаркетплейсов.ДубльГис Тогда
		
		// Установка атрибутов корневого узла
		КорневойУзел = ДокDOM.ДочерниеУзлы.Элемент(0);
		ДатаВремя = Формат(ТекущаяДатаСеанса(), "ДФ='yyyy-MM-dd HH:mm'");
		КорневойУзел.УстановитьАтрибут("date", ДатаВремя);
	
		// Формирование узла описания магазина			
		ОписаниеМагазина = ДокDOM.СоздатьЭлемент("shop");

		СоздатьДочернийЭлемент("name", ОписаниеМагазина, ПараметрыПрофиля.Shop_name, ДокDOM);
		СоздатьДочернийЭлемент("company", ОписаниеМагазина, ПараметрыПрофиля.Shop_company, ДокDOM);
		СоздатьДочернийЭлемент("url", ОписаниеМагазина, ПараметрыПрофиля.Shop_url, ДокDOM);
		СоздатьДочернийЭлемент("email", ОписаниеМагазина, ПараметрыПрофиля.Shop_email, ДокDOM);

		// Описание магазина - узел <currencies>
		Валюта = ДокDOM.СоздатьЭлемент("currency");
		Валюта.УстановитьАтрибут("id", "RUR");
		Валюта.УстановитьАтрибут("rate", "1");

		СписокВалют = ДокDOM.СоздатьЭлемент("currencies");
		СписокВалют.ДобавитьДочерний(Валюта);
	
		// Описание магазина - секция categories
		СписокКатегорий = РегистрыСведений.МП_КатегорииYML.РазделКатегорииМагазина(ДокDOM);
 
		// Формирование узла описания магазина			
		ОписаниеМагазина.ДобавитьДочерний(СписокВалют);
		ОписаниеМагазина.ДобавитьДочерний(СписокКатегорий);

		СписокПредложений = ДокDOM.СоздатьЭлемент("offers");

	КонецЕсли;

	Если ВидМаркетплейса = Перечисления.МП_ВидыМаркетплейсов.Юла Тогда
		
		// Установка атрибутов корневого узла
		КорневойУзел = ДокDOM.ДочерниеУзлы.Элемент(0);
		ДатаВремя = Формат(ТекущаяДатаСеанса(), "ДФ='yyyy-MM-dd HH:mm'");
		КорневойУзел.УстановитьАтрибут("date", ДатаВремя);
	
		// Формирование узла описания магазина			
		ОписаниеМагазина = ДокDOM.СоздатьЭлемент("shop");

		СписокПредложений = ДокDOM.СоздатьЭлемент("offers");

		КорневойУзел.ДобавитьДочерний(ОписаниеМагазина);
		ОписаниеМагазина.ДобавитьДочерний(СписокПредложений);

	КонецЕсли;

	Возврат ДокDOM;

КонецФункции

#КонецОбласти

#КонецОбласти
